<?php

// Задание 1
$a=0;
while ($a<=100) {
    if ($a%3==0) { 
        echo $a." ";   
    }
    $a++;
} 
echo "<hr>";

//задание 2
$b=0;
do{
    if ($b==0){
        echo $b."-ноль <br>";
    } elseif ($b%2==1) {
        echo $b."-нечетное число <br>";
    } else {
        echo $b."-четное число <br>";
    }
    $b++;
} while ($b<=10);
echo "<hr>";

//Задание 3
$russia=[
    "Московская область" => ["Зеленоград", "Клин", "Москва"],
    "Ленинградская область" => ["Санкт-Петербург", "Павловск", "Крондштат"],
    "Кемеровская область" => ["Кемерово", "Белово", "Ленинск-Кузнецкий"]
];

foreach ($russia as $area => $cities) {
    echo "$area : <br>";
    foreach ($cities as $city) {
        echo $city." "  ;
    }
    echo "<br>"; 
}
echo "<hr>";

//Задание 4

function translit ($text) {
 
    $word = [
 
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',
        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya'];
 
    return strtr($text, $word);
}
echo translit ("Это тестовый текст");
echo "<hr>";

//Задание 5
function delBackspace ($str) {
    $text = [" " => "_",];
    return strtr($str, $text);
}
echo delBackspace("Это тестовый текст");
echo "<hr>";

// Задание 6

$shop = [
        "Главная" => "#",
        "Товары" => ["Женская одежда"=>"#","Мужская одежда"=>"#","Детская одежда"=>"#",],
        "Корзина" => "#",
    ];

echo "<ul>";
foreach ($shop as $key => $value) {
    if(is_array($value)){
        echo "<li>$key:";
        echo "<ul>";
        foreach ($value as $product => $url) {
            echo "<li><a href=$url>$product</a></li>" ;

        }
        echo"</ul></li>";
    }else{
        echo "<li><a href=$value>$key</a></li>";
    }
    echo "<br>"; 
}
echo"</ul>";
echo "<hr>";

//Задание 7
for($i = 0; $i <= 10; print $i, $i++);
echo "<hr>";

//Задание 8
$russia=[
    "Московская область" => ["Зеленоград", "Клин", "Москва"],
    "Ленинградская область" => ["Санкт-Петербург", "Павловск", "Крондштат"],
    "Кемеровская область" => ["Кемерово", "Белово", "Ленинск-Кузнецкий"]
];

foreach ($russia as $area => $cities) {
    echo "$area : <br>";
    foreach ($cities as $city) {
        $cityArr=preg_split('//u', $city, -1, PREG_SPLIT_NO_EMPTY);
        if($cityArr[0]=="К") {
            echo $city." " ;
        }
    }
    echo "<br>"; 
}
echo "<hr>";

//Задание 9

//echo delBackspace(translit ("Это тестовый текст"));

function translitNine ($text) {
 
    $word = [
 
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',
        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya'];

 
    $textEng=strtr($text, $word);
    $text = [" " => "_",];
    return strtr($textEng, $text);
    
}

echo translitNine("Телевизор 45 дюймов 3d");
